* GENERATE COORDINATES WHICH CORROSEPOND TO THAT OF NC4 FILES
*此檔案是要將nc4 run出來的資料對應其該有的時間、緯度、經度


import excel "D:/00_work/07_GWR_Ghana/sheet1.xlsx", sheet("Sheet1") firstrow clear
//產生10800個觀察值。
//LON台灣經度範圍:116.875~123.125共橫跨(123.125-116.875)/0.625+1 = 11個grids
//-----GH 291-282+1=10
//LAT台灣緯度範圍:20~27.5共橫跨(27.5-20)/0.5+1 = 16個grids
//-----GH 203-189+1=15
//nc4 Taiwan TI day data每天有4筆資料，所以時間有4個單位(0~3)
//-----氣壓level:18層(450HPA~1000HPA)
//-----10*15*4*18 = 10800

//nc4 出來的觀察值是先run經度(lon)再run緯度(lat)最後run時間
//舉例:第1筆觀察值是(time=0，lon=116.875，lat=20)，第2筆觀察值是(time=0，lon=116.875+0.625=117.5，lat=20)......
//跑完第1個緯度後是第12筆觀察值(time=0，lon=116.875，lat=20+0.5=20.5)，第13筆觀察值(time=0，lon=116.875+0.625=117.5，lat=20+0.5=20.5).....
//-------------------11
//跑完第1個時間後是第177(11*16+1)筆觀察值(time=1，lon=116.875，lat=20)，第178筆觀察值(time=1，lon=116.875+0.625=117.5，lat=20)......以此類推
//-------------------10*15+1=151
//最後一筆觀察值(time=23，lon=123.125，lat=27.5)
//--------------------3

gen time=. 
replace time=0 in 1/2700
replace time=1 in 2701/5400
replace time=2 in 5401/8100
replace time=3 in 8101/10800
//將每筆觀察值的時間對應上去
//每一時間單位各占全部觀察值的1/4

gen lev_a = floor((num-1)/150)
gen lev_b = lev_a - time*18
gen lev = 1000 - lev_b*25
//將每筆觀察值的氣壓對應上去
//因為氣壓有18層，所以3168/18=176
//--------------------2700/18=150
//floor()為無條件捨去法
//氣壓第一層為1000HPA，每一氣壓層遞減25HPA(*但後來發現並非全部都遞減25，在step6有做修改*，700HPA後每一氣壓層遞減50HPA)
//此運算法可將每一時間單位出現18個氣壓層


gen lat_a = floor((num-1)/10)
gen lat_b = lat_a - lev_a*15
gen lat = lat_b*0.5 + 4.5
//將每筆觀察值的緯度對應上去
//因為緯度橫跨16個grids，所以176/16=11
//------------15-------------150/15=10
//floor()為無條件捨去法
//緯度單位為0.5
//緯度最一開始為20
//--------------4.5
//此運算法可將每一氣壓層出現16個緯度單位
//--------------------------15


gen lon_a = num-1
gen lon_b = lon_a - lat_a*10
gen lon = lon_b*0.625 -3.75
//將每筆觀察值的經度對應上去
//經度橫跨11個grids
//--------10
//經度單位為0.625
//經度最一開始為116.875
//-------------- -3.75
//此運算法可將每一緯度單位出現11個經度單位
//----------------------------10

drop lev_a lev_b lat_a lat_b lon_a lon_b 
save "D:/00_work/07_GWR_Ghana/working_data/sheet1.dta", replace


